tap "hologos/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Passphrases to remember
brew "diceware"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql", restart_service: true
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@14"
# Manage multiple Node.js versions
brew "nvm"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Development kit for the Java programming language
brew "openjdk@11"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Dependency retriever for version control and archives
brew "peru"
# General-purpose scripting language
brew "php"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Show ps output as a tree
brew "pstree"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Command-line client for Travis CI
brew "travis"
# Source code beautifier
brew "uncrustify"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# General-purpose scripting language
brew "shivammathur/php/php@7.3"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# UML (Unified Modeling Language) design app
cask "celestialteapot-runway"
# Disk space visualizer
cask "daisydisk"
# Translate words without ever opening a dictionary
cask "dictionaries"
# Voice and text chat software
cask "discord"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# Enables DisplayLink screens prior to login
cask "displaylink-login-extension"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Productivity app
cask "dropzone"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# App to manage access to corporate apps, data, and resources
cask "intune-company-portal"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Legacy runtime for the Java programming language
cask "java6"
# File system integration
cask "macfuse"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Calculator and converter application
cask "numi"
# PDF reader, editor and annotator
cask "pdf-expert"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# PHP IDE by JetBrains
cask "phpstorm"
# Home media player
cask "plex"
# Home media server
cask "plex-media-server"
# Collaboration platform for API development
cask "postman"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Backup, recovery and cloning software
cask "superduper"
# Native GUI tool for relational databases
cask "tableplus"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Time tracker
cask "toggl-track"
# Git client focusing on power and productivity
cask "tower"
# File transfer application
cask "transmit"
# Control your data usage on slow or expensive networks
cask "tripmode"
# Configurable document editor that supports Markdown
cask "typora"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1Blocker", id: 1365531024
mas "Evernote", id: 406056744
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pixelmator", id: 407963104
mas "ReadKit", id: 588726889
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
